# NumberOfCompletedFaceSets Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..NumberOfCompletedFaceSets Property
TessellatedShapeBuilder Class See Also
---
Number of completed face sets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int NumberOfCompletedFaceSets { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfCompletedFaceSets As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfCompletedFaceSets {
	int get ();
}
```

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace